---
kind: method
id: M:Autodesk.Revit.UI.ExternalApplicationArray.#ctor
source: html/ce76e746-2dce-a3a1-5d03-c9a376a4d74e.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.#ctor Method

Initializes a new instance of the ExternalApplicationArray class

## Syntax (C#)
```csharp
public ExternalApplicationArray()
```